# <div align="center">SERIES</div>

In [2]:
import numpy as np
import pandas as pd

In [3]:
a=['a','b','c','d','e']
d=['a','b','c','d','e']
b=[1,2,3,4,5]
c={1:'a',2:'b',3:'c',4:'d',5:'e'}

In [4]:
x=pd.Series(b,a)
y=pd.Series(b,d)

In [5]:
z=x+y
type(z)

pandas.core.series.Series

In [6]:
print(z[:'c'])

a    2
b    4
c    6
dtype: int64

In [7]:
print(z['c'])

6

# <div align='center'>DATAFRAMES</div>

In [8]:
a=[1,2,3,4,5]
b=[0,2,4,6,8]
c=[1,3,5,7,9]
d=[0,1,2,3,4]

In [9]:
df=pd.DataFrame([a,b,c,d],['a','b','c','d'],['p','q','x','y','z'])

In [10]:
df

   p  q  x  y  z
a  1  2  3  4  5
b  0  2  4  6  8
c  1  3  5  7  9
d  0  1  2  3  4

In [11]:
df['s']=df['y']+df['z']   #adding the column

In [12]:
df

   p  q  x  y  z   s
a  1  2  3  4  5   9
b  0  2  4  6  8  14
c  1  3  5  7  9  16
d  0  1  2  3  4   7

In [13]:
df.drop('a') #to delete the row temporarily

   p  q  x  y  z   s
b  0  2  4  6  8  14
c  1  3  5  7  9  16
d  0  1  2  3  4   7

In [14]:
df.drop('a',inplace=True)  #to delete the row a permanently

In [15]:
df.drop('s',axis=1,inplace=True)  #to delete the column permanently

In [16]:
df

   p  q  x  y  z
b  0  2  4  6  8
c  1  3  5  7  9
d  0  1  2  3  4

In [17]:
df['z']   #to access the elements of column z

b    8
c    9
d    4
Name: z, dtype: int64

In [19]:
df.loc['b'] #to access the elements of  row a

p    0
q    2
x    4
y    6
z    8
Name: b, dtype: int64

In [20]:
df.iloc[0]  #to access the elements of  row by index number

p    0
q    2
x    4
y    6
z    8
Name: b, dtype: int64

In [22]:
df.loc['b','z']  #to access the element of specific row and specific column

8

### Conditional Accessing

In [23]:
df>3

       p      q      x      y     z
b  False  False   True   True  True
c  False  False   True   True  True
d  False  False  False  False  True

In [24]:
df[df>3]

    p   q    x    y  z
b NaN NaN  4.0  6.0  8
c NaN NaN  5.0  7.0  9
d NaN NaN  NaN  NaN  4

In [26]:
df[df['y']>3]  #print all rows in the 'y' column which are greater than 3

   p  q  x  y  z
b  0  2  4  6  8
c  1  3  5  7  9

In [29]:
df[df['y']>3][['p','y']] #to print only 'p' and 'q' column in above dataFrame

   p  y
b  0  6
c  1  7

In [33]:
df[(df['x']>4)  & (df['y']>4)]  #for multiple conditions we can't use 'and' and 'or', we should use & and  |

   p  q  x  y  z
c  1  3  5  7  9

### Missing Values

In [2]:
import numpy as np
import pandas as pd

In [7]:
d={'a':[1,2,3,4,5],'b':[6,7,8,9,np.nan],'c':[1,5,6,np.nan,np.nan],'d':[4,5,np.nan,np.nan,np.nan],'e':[5,np.nan,np.nan,np.nan,np.nan]}

In [8]:
df=pd.DataFrame(d)  #make a dataframe

In [9]:
df

   a    b    c    d    e
0  1  6.0  1.0  4.0  5.0
1  2  7.0  5.0  5.0  NaN
2  3  8.0  6.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [10]:
df.dropna(axis=0)  #In pandas axis=0 means rows. So, all the rows with nan values will get eliminated.

   a    b    c    d    e
0  1  6.0  1.0  4.0  5.0

In [14]:
df.dropna(axis=1)   #In pandas axis=1 means columns. So, all the columns with nan values will get eliminated.

   a
0  1
1  2
2  3
3  4
4  5

In [15]:
df.dropna(thresh=5)  #get all the values with at least 5

   a    b    c    d    e
0  1  6.0  1.0  4.0  5.0

In [17]:
df.fillna(1)  #fill all nan with 1

   a    b    c    d    e
0  1  6.0  1.0  4.0  5.0
1  2  7.0  5.0  5.0  1.0
2  3  8.0  6.0  1.0  1.0
3  4  9.0  1.0  1.0  1.0
4  5  1.0  1.0  1.0  1.0

In [19]:
df['b'].fillna(df['b'].mean()) #fill the nan of column b with mean

0    6.0
1    7.0
2    8.0
3    9.0
4    7.5
Name: b, dtype: float64